# Linux
第一章  用户登录与注销



	1. 登录模式：



	*   图形界面登陆： 图形界面也称为窗口，是默认的登录界面，即平常我们所见到的桌面，和Windows桌面差不多；
	*   文本模式登录： 其实就是图形界面进去之后要打开的终端；（个人比较喜欢这个，在外行看来比较高大上）；想要将你的Linux设置为启动后自动为文本模式登录， 需要早root 权限下  vim  etc/inittab   , 找到 id: 5 : initdefault 这行，按一下 i ,进入insert模式，将 5 改为3 ，然后重启电脑即可！


           

	* 上图的 login: 提示你输入用户名， Password提示输入密码；
	* [ root@bogon ~]# : @之前的代表用户名，@之后的bogon为计算机名称， ~为当前用户所在的用户账户目录， # 是root用户的提示符，此时管理员路径为 /root；而“$”是普通用户的提示符，此时用户当前路径为用户所在默认路径 /home/ ;要理解普通用户和root用户的区别；
	* root 用户：   root的英文意思就是根的意思，在Linux中root享有最高权限，注意：用户名必须是root；



	1. 模式切换



	* 图形界面——文本模式：只需要同时按下 Ctrl + Alt + (F2~F6),即可，F2到F6 可以同时有6个文本模式登陆界面，想要回到图形界面，只需要按下Ctrl + Alt + F7即可，因为一般情况下当前的图形界面就属于F7； 不过也有例外，我的电脑图形界面属于F1号屏幕；
	* 文本模式——图形界面：只要输入命令 startx 即可；（目前我还不知道这样如何再回到以前的文本模式）


	1. 用户的退出和关机



	* 在字符界面下输入 logout 或者 exit 都可以退出当前用户， 图形界面下则用 exit 退出当前用户；
	* shutdown 命令： shutdown是root用户的命令，一般的使用为   shutdown  【选项】【时间】；

           选项： -k : 告诉其他在线用户系统要进入维护模式，是一个警告！  这个感觉好吊！
                      -r :  重新启动系统，比如   shutdown -r  now;   可以通过 man shutdown 了解；
                     -h:   关机， 比如   shutdown -h  now; （其他关机命令： halt:正常关机 ,  reboot：重新启动, poweroff：关机并且关闭电源）
                      -f:   跳过fask（检查文件系统并尝试修复错误），系统快速的关机并重启；
还有一些shutdown  没有列出来，是现在不太用的，而且也不是很明白作用！

ps:   在Linux中 按下Ctrl + c 可以取消当前命令~
